#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Acquiring state lock. This may take a few moments...
azuread_group.k8s_administrators: Refreshing state... [id=f453d3b2-44fe-4359-83cc-1328bcf53d27]
azurerm_resource_group.k8s_rg: Refreshing state... [id=/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourceGroups/demo-k8s-rg]
azurerm_user_assigned_identity.k8s_uami: Refreshing state... [id=/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/demo-k8s-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/demo-k8s-uami]
azurerm_log_analytics_workspace.k8s_monitor: Refreshing state... [id=/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/demo-k8s-rg/providers/microsoft.operationalinsights/workspaces/demo-k8s-monitor]
azurerm_storage_account.k8s_storage: Refreshing state... [id=/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourceGroups/demo-k8s-rg/providers/Microsoft.Storage/storageAccounts/demok8sstorage]
azurerm_kubernetes_cluster.k8s_cluster: Refreshing state... [id=/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/demo-k8s-rg/providers/Microsoft.ContainerService/managedClusters/demo-k8s]
azurerm_storage_container.k8s_backup: Refreshing state... [id=https://demok8sstorage.blob.core.windows.net/demobackup]
azurerm_kubernetes_cluster_node_pool.k8s_nodepool_dev: Refreshing state... [id=/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/demo-k8s-rg/providers/Microsoft.ContainerService/managedClusters/demo-k8s/agentPools/devtest]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.k8s_cluster must be replaced
-/+ resource "azurerm_kubernetes_cluster" "k8s_cluster" {
      - api_server_authorized_ip_ranges = [] -> null
      - enable_pod_security_policy      = false -> null
      ~ fqdn                            = "demo-k8s-33c3c578.hcp.southeastasia.azmk8s.io" -> (known after apply)
      ~ id                              = "/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/demo-k8s-rg/providers/Microsoft.ContainerService/managedClusters/demo-k8s" -> (known after apply)
      ~ kube_admin_config               = [
          - {
              - client_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUUvRENDQXVTZ0F3SUJBZ0lRRkRHNElieUt5U2lHZWJMTnFJaEVzVEFOQmdrcWhraUc5dzBCQVFzRkFEQU4KTVFzd0NRWURWUVFERXdKallUQWVGdzB5TURFeE1EZ3hORE0zTWpOYUZ3MHlNakV4TURneE5EUTNNak5hTURBeApGekFWQmdOVkJBb1REbk41YzNSbGJUcHRZWE4wWlhKek1SVXdFd1lEVlFRREV3eHRZWE4wWlhKamJHbGxiblF3CmdnSWlNQTBHQ1NxR1NJYjNEUUVCQVFVQUE0SUNEd0F3Z2dJS0FvSUNBUUN4TFN5SzJXWXdDYTBlMFY1Z1M0QjYKYnhtZThiNmdVQ0l3bE9QVGtSOTEwUmwxSk93VmJwMk1PUEJETWRsSCtKaUZJa3U1eVV4VFlGcHZGdlYxWU1UaQplaEpBcVdUakdPSUk3RGtrZi83Rks3WmxETUxhcW9KYlVFa0xQR2lackEwQXpBdlY2bXB2TWpVbk8yRExuSkNMCm1RdUhHeUpMNE5BUmNXaWpVdlhNOHlUdnB3N3Zpc2RvMDk2MXhINWdLU0JuWE8yZ1R1ZUhlOGtqYkdWb3FMUmgKR2tUK0RsSktzczA4WXBRNElXeDBhRjB4Q2hiQmJ1dWxmQ0ZtQit6ZnBVclNGR1pnUEIwV0YwcklReHArV29iQwpnRU9YeVY2NnlQQlltRmM0Uy9CWVdtZnNYSUxWeUx3SUdUYmlnQ1MxWlJ2Q3hzV2MrMk5yMEsycjhqL251bUNFClRyeDNKZzM5YXpiMVd2QWNmOGE0cU9pUW1BSVhaSUV3ZzJMMS9XNG1BbVpVTmFRRm82UlJqbXQzNldEdENuMVAKYTVHaEdjaTNXOFQydVVDaEhaeXd3SFowL0pTQXpKUVVVR2FHdFNSdDhOaWRWUmxFUld6UVZOMXA4T0s0RzVJNwpERnI2SUhWWWh6d3F6eDFmV0Z0eGJZNWo5U0xvU0JXME43VHJCcmw3UVdLbEoxOW8rN3ZtZ3RLWlYvS2FyeGoxCm1MdWFJb3RZaWlJWTZldkNoRkhQcjdUSFEwNkhqRTM5dmFabGMyeDVGb3RJSE1lbkNEcWRvcTB4M3c3Vmd0MjgKOW1xTXlwM0d2QW9PdnFPVlhNMlRqbkpaT1Rwd2xXNGFWVW9jM0dwbCtDWTNwVFNRNG82d093ZWdud3lIcVlMYQoxUTJjSWNkK1YwY1JwZE1TZTQ4MzJ3SURBUUFCb3pVd016QU9CZ05WSFE4QkFmOEVCQU1DQmFBd0V3WURWUjBsCkJBd3dDZ1lJS3dZQkJRVUhBd0l3REFZRFZSMFRBUUgvQkFJd0FEQU5CZ2txaGtpRzl3MEJBUXNGQUFPQ0FnRUEKRXdzU2p6VUtuTlRwN2kwTlFCWHN2VVkzNkxrVHhjOG1XaUlCN3hyZGt4WjR6UGZJTmhERlhDQjNlNmIwWTRPbAp5Uk1tZjNsOGdlYURVWlZ6K2NVclRlaW9XeVU1N1RvNW8yZmdxeVBqVnFLaEhTMUlLakJBNFRyY09rOFZkVU9GCll4VnJYWkFxaUdwSGhxN1A5MGp5YWZhWEtxNDYvQThaYUM4WFZUNzNtc2lkZ2lrQ2RqVkVHWldUVEhGVE4xSTAKU1dIZm9SRmlEdWd5VlVYNzZJcGthMGxkc3BkRVJ6N1FUeUtXdGRPWHVmNkxHK3FzeXJBY2xWb0VxajZvOFpDTAo3L0VvQWRkUVNNVmMzZzVRNExQSklXQTZkeStQdXREaXY1ZG1hSWZlRDAzeEFUaFVNY3diRFNOWGU3L1BSdHdGCk02VWFJaENkMEJXanFsMjFXd1pKYlRRdDNNVlRUK0pDc2NZZTN3TWhJTkJmV3ZxdmpsNGo1NU80d2N3dEQ1cHEKc3QvQnFiRS9KcnV5UjRBWnF6REcxclJROXRQb3lFbWRTWkF4UHplR0pBUnI1Ynl4Y0NqMGYxTURWRzBlMUJJLwovbXA2QkRCV2EvbXpXdFJ4cjhaYzhmMjh2NWVhRHJhZkRHOVhsOWo1eVh5cGlSOG95bmRVK1MwLzFpV04rYldqCm5tbTFhRlF1OFdGUFVkMWlHUzVLMGM4MG0yRVIxV1hNR2g4Z0ZjR3hyQ0R4V1lRK0wxcnBYSllPYjYvWmV2M3UKS053KzI5aVJ5QUNhN0hnalk5bU1rUVBPSms2NEJPNDM0MkpiMHZ5bldoWERHcnVKTnI5aXh1RW9IdzJKYXcvMwpkT2lGeW5mOVRURExLVkZvV3pFZVZSYjFxRHBEOXRDTGZoMzVwb0txYjZzPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
              - client_key             = "LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlKS0FJQkFBS0NBZ0VBc1Mwc2l0bG1NQW10SHRGZVlFdUFlbThabnZHK29GQWlNSlRqMDVFZmRkRVpkU1RzCkZXNmRqRGp3UXpIWlIvaVloU0pMdWNsTVUyQmFieGIxZFdERTRub1NRS2xrNHhqaUNPdzVKSC8reFN1MlpRekMKMnFxQ1cxQkpDenhvbWF3TkFNd0wxZXBxYnpJMUp6dGd5NXlRaTVrTGh4c2lTK0RRRVhGb28xTDF6UE1rNzZjTwo3NHJIYU5QZXRjUitZQ2tnWjF6dG9FN25oM3ZKSTJ4bGFLaTBZUnBFL2c1U1NyTE5QR0tVT0NGc2RHaGRNUW9XCndXN3JwWHdoWmdmczM2VkswaFJtWUR3ZEZoZEt5RU1hZmxxR3dvQkRsOGxldXNqd1dKaFhPRXZ3V0ZwbjdGeUMKMWNpOENCazI0b0FrdFdVYndzYkZuUHRqYTlDdHEvSS81N3BnaEU2OGR5WU4vV3MyOVZyd0hIL0d1S2pva0pnQwpGMlNCTUlOaTlmMXVKZ0ptVkRXa0JhT2tVWTVyZCtsZzdRcDlUMnVSb1JuSXQxdkU5cmxBb1IyY3NNQjJkUHlVCmdNeVVGRkJtaHJVa2JmRFluVlVaUkVWczBGVGRhZkRpdUJ1U093eGEraUIxV0ljOEtzOGRYMWhiY1cyT1kvVWkKNkVnVnREZTA2d2E1ZTBGaXBTZGZhUHU3NW9MU21WZnltcThZOVppN21pS0xXSW9pR09ucndvUlJ6NisweDBOTwpoNHhOL2IybVpYTnNlUmFMU0J6SHB3ZzZuYUt0TWQ4TzFZTGR2UFpxak1xZHhyd0tEcjZqbFZ6Tms0NXlXVGs2CmNKVnVHbFZLSE54cVpmZ21ONlUwa09LT3NEc0hvSjhNaDZtQzJ0VU5uQ0hIZmxkSEVhWFRFbnVQTjlzQ0F3RUEKQVFLQ0FnQXpUYkpsTGxoaHRwdVRuZXFuRlpYSlhoeGNJd0lnNTdOT3YvNU1oK3hGTUZ3ZnlLWTMrb1RTVXJaMwpycHFOTlpYc2p5YkFVR0t5amVjQjNmTUxudzdEeWJjNVZCT3Jrc3Y0NjNZTWRLZXdMbDB0VzRtY3lkemZWaHNnCmpzaDNIeFBRMUVUbEYzRGthL1JxUE01bGh4dHY0TXd1dmhPclJ4all4QzhaZys4Ni9ua0drQ2hLQXJTRlRUeGoKQTlmWVBuQnNuY01OTld2amxsdUN6Mk41NzhmemlpaktMQmwyR2RwR0R3RitVMmRWT2RjcVdSS0h4bmVqdnBMcApPWWhFcGxkSkI3RXhVcGJWaTc4U3lDT0d6TzNTcWxOb1ExNFQxaFdLZ2VwWG1kMnBwOXdKM0N2aWZiSzg0Wmc3CjlBRXRLVzdsY3F0TUxwcjJZRUc1MVhiZHdlRXFVclFkcUVPakUzQVZBRE90R0NzeVB2N0x0VE96a1VWWU1vT2IKTlNKUkZFMDdmQ2t2K1MydmV6YnM3bm9BTjRUNmgvL0hDSHBKYitDRmozNEd4WTRzRjk3UFR2S0JKSFIrNTBBVwpVcktsYnFLUHJaUWFJenVybjZvdDhXTXFrKzRQZnA5RWF2RHErV0o5SDFMa1ovd1BFZ2MwNGNqZ3dqMW84eDhPCkVDQUxBNEhNbmFybE1TL1dYTC9KTG8yVGhYdG90M04rUmNyc3dmam43ajZaNlpjYUJ0VnRrMWFuVnBDQWlMNVAKMWJxMzYrYUpNa1kvdkM1dEkxMWhKNVd5SG5kcENwTXpQR0ZYVkJxRFVQbjdVOTI0M1FyeklxSGFFY213Q2E5dQpSTVJpUysxLzlGbHdsTm5xbkV1N2JwN1hRL0Fzcm4wRmYyQzlvR1VuZ0lYMFNQWnE4UUtDQVFFQXdOMkVBT1lICkxOSFEzMmdmRXFUeDVsVHZKdXRWSU5LWjVMdVlDcGtFQ2lKcVZ1SXJwTlZ3eVE4K0U3cHhiV3hIazNoYjdMY1QKOTc2R2Z5aE4ramFFRnllaWZKTHFPaStUUDRtVFU0UHY2ZThmcEhTWDRpeTFWSERKRmI4RGhRc0VCeW5jbk5yOQpzb2JvMllrRk40YW9YbjhtMERQMW5Ud1FIQVIrUmx1UjNablR0S1BKd2IrdDMrcjNzVWR3VXpjYkRLSjNWVU1nClhjdm5PdmVRTmZ2NDRDRUZtREVWOVh2dndYOTl5aTdLRGswckI5a2RpSVVCZ3UxcE03bms3aDRyZk5UODlDVDUKWXMvcSt1S3pEclVnQjRmNVQzelpEeW9haXNLbjhacTBhVEx2bktmbjZUaUpVa1lEcVEweHhmK2ZkVmJaZW9LOQpTaHoyc010S2pDRm5PUUtDQVFFQTZ5em5XWWlxem5yVUd1Nys1aGZOTzVGc0dpNUM5YUZFZERlQzlJWjB2K25OCm1tOUtkT2VBZXdaWXRURzdIaFVYSjlXQ2F0Smw4UVg1VEh6TGVZK0RPZWllbC81MUVDMnBsRzVyVm1QaFFYanAKbnluRkN2emkvSkdmamFhL2RhdmdBNU9HUDJ0OTNFR1dZZUNNSEVQcVZtZUxzbDJ1SEFybmJmM2VWYjJHNnpNaApuTyt1ak5CRGE2SmNkTWtxajN1RUNhV2NkdWNqU3NMZTllcnRQMzhBbHgyR1JtaXlBN2JOc0RFWWQ2aGVFZjFmCnE4amIvM3dTRldIQVg1WmV6a2F0YWJkNmNzSm9WOEpEQTdFdGNrMVNnYktKZnJLUG96N1Z1V2RySmRXMWt3QUUKZmEyTXRWMzd3K2tUT1I2NmNqNlprTkpTRmxzS0gvL2VsSWU1RHBGanN3S0NBUUFTa29KT3I5Z0xDZDFxVmhWLwo3eUJZUk4rT3lPUzJ0M0VZWkxROGVRVzVrQnpiWndZNjVrN3BIYTJscXJPWGpQRExrN0NPZUFiVk9hU3NCQTZXClJMK3RseVIvaUlwRHRpY2czRGV5dUNiWFNTNnI0SXBydmxCcjVEeUkrbzcxTmQxYWJ6Nk9ZRXhENzlmbWN0cHMKd1d2ZlJiRlFKV0RHbG0wYXRaZ1BZR3dJZ2ZLd0Y0R3JSYkVSdWdmR0s1SDJnWHo2VjM3VVdCVjYwdExlaTg1NApWRjVmL3U0Ui9OQVhocXJNNEdFVm9qSFU5THRyRXc1VUFqTG1EOFNzdFg4Rkt5U1c3Yys2RndGbzhZcTRSREpuCi9Tc3JibjJrbU9veUdxVFpyZXNNU2hDTGZOczBJN3NpYTA1Vi9PWUhWbnp2aXpFbzFJYzIwL1kwZDl1TnBOWDEKN3BXSkFvSUJBUURsMWZldnYrbzJhMEk1cEZNSEtrSFFNcG8wcC91V3RPb0NybkhVYWtkVmU3a05jakNST2VLTgoyVEQrdkVDRDhOYTFmbXU3M0MzMnRRRGthSjR2Q2p1VWI2djNIWjdvbGNmQ29YdFRiYitxVGZIOE5FVTNMTmpsClA2aHdOb090QzdHZHJTS3Bmbkw5dkRldEpsZW9GQlBFSitRV0NJbnRMQmJybncwWVBHYk1IQ2VBaVpuTVVvbGgKZXNiaTkrc1pXUHc4dFZiSnViRDdFcUgyTW9kMDQ3ais5c0xRc3VjdXpBd1BZcHZuN1dzcUo3YkZXMEx1V0NJUQpOWDFkcmNhdno5RVFuVmtWS0x2eThJNnY0QXRyUnZnWWV4VDI5cWw4UUI5OTEvMldkMXJCOUdWdk1ocHU4Zy9vCmNqUHdRZ0N6UUV5eWhXbm1JVWt1NXRCdjFvamNIT2tUQW9JQkFIeThGMXgrTWRqc3FSSmlCaWhtRjBXM0FKTlQKMFp4KzhWOFp6Uis2cXZONEdpQnZtSkZ1bWxvYkxzNkdtQm1YaGY5ZXUyay9wTHJ4NnB4Rk1yT0MzcS9UU3VhdQpQWVFRaTlkMkhJZHk0S3BtTGZNUFdvUVlSN3lzaVFtTkdScUZHYVA2V3g5cEEwN1RuSEZMY29yRXJiNDQ3V3UzCktXdWVSQzVhMXlFNVVkYUY4NytuS01JL0NGZmJJZlo4ZFVUT0xOSXpkZGVFR2FGZ01PcGd2dCtVbXRDMFU4TXgKaFpUMTBtMG92Y3l1c3AveVZxa3oybnBSdExFNVVnZmlYMzkrdlp6SFZ3UkxvZVNyeEVmU0lOYkNuUWZmZURWMgo3NHU1d0FndC83NlJWQlZ0YUZmUmlCcTlndW85dTF3MzZqbDdCMUwxb1RZanVhcC9aY3RQUGF3Vm1JQT0KLS0tLS1FTkQgUlNBIFBSSVZBVEUgS0VZLS0tLS0K"
              - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUV5VENDQXJHZ0F3SUJBZ0lRWkVPR2hwQzk1d3hWYVJoQ0pqMmVXVEFOQmdrcWhraUc5dzBCQVFzRkFEQU4KTVFzd0NRWURWUVFERXdKallUQWdGdzB5TURFeE1EZ3hORE0zTWpOYUdBOHlNRFV3TVRFd09ERTBORGN5TTFvdwpEVEVMTUFrR0ExVUVBeE1DWTJFd2dnSWlNQTBHQ1NxR1NJYjNEUUVCQVFVQUE0SUNEd0F3Z2dJS0FvSUNBUURTCjRpbjU3ekJhWFdOZ2xLYnlUTnROdCsyUldleUlxQ1NJRnRvM1VGc1VzR28wQzhMNlpNcnJub0N6ZDRKTy94ekEKbHozdmEwVFY3eExNb0JqY1JUSGJUV2wyQklBUko4a01Qc0c4UUZwekFHbGJ0cmJmUHVBOUd4c3U5eUd6WmpNSwozZUFpNjdoUzZkc1RjNFJ4dHFzQng1Uzdkc0lSOTNVU0cvNWhhRE5wZzlHcm5vWCtyVFpjd0FsL2hqMTZSZlp4Cis4eE95VVJjbzIxTGo1K0FlTzFlN1Y4RHhvT29mZ0RXS2hROGQ0MVp2TkNEdGJVcGZTQlo3N3dHMVBrSG1vdmoKcHlvNEwzQWtBcmxYY1RWZ1ZzOE5NbmZ6emlva0VtTDgvTUxZenVaWlNpZTN2MlhjUElHMDE5YmZoalowRXh3agp4RDBENmMwdXg0VGhRZGg3bHh4cTJ0UlY5MHlPbG5xTk0yY0VSYTQvYnllVVdRSUgra3ExUGFYY1RIZTk5Qit3Cnh6M214Y29RVXBOZ0dLVXByK1lIL0llak9CYUVTaWxmWVBWaVdyNytKQ1lQZlYvUy82QVhJcXlMSTJ4R3V2OTIKRXFGM1lvbUJNaEl6aWdmckZGTFoxRkcvTWt5NVE2MWVGMjlQYm1xdnRSZHJGWHBud2VQNk9lY3dzZkplUnh4WQpVSkxFZTlxYkhhek5LajZxMENVVFFYQWZESkgvaGw3Wi9xQllhSTEyNFl0YW9iRWFoZTkwVWJ3Q3ByR1ZScUFqCmwzSHFvTTVwTlRpeGQvRDdybXR6WWRvenMxOThDcG9KSnFqbnErcVJxMndwN3NCWmVqa1hTSmovVTJuM2hVL1cKcFp1ZW5YVjh5Vm13VTEwN3hMaW1OQjB5R3k2aDBBSHJHeG45eGFnYVl3SURBUUFCb3lNd0lUQU9CZ05WSFE4QgpBZjhFQkFNQ0FxUXdEd1lEVlIwVEFRSC9CQVV3QXdFQi96QU5CZ2txaGtpRzl3MEJBUXNGQUFPQ0FnRUFhaG1YCklhcDFybytwc1RZNXlTSUhrdTlmSU5GNHNHaXVldlRHVnRJWkFFbUZsWUIwU0xnOFdYbnE4SnkvNDBEbzA5NG4KdXdIV1NXYzVGR3R0Y2JrRDRUTzQxUXMwQ01RRnhIQzlNMjlta1FpVjJ1RkRsWHNMOEdRTFNJcGFZTzExRWdWbQptNXhxSG10WStHRFlWTkIyWURLSUZYMHpEb1FDTmNSUjF0NDYydzhlc3ltUWlXaDhpWUgySExiQU9KU2hzYWs2CjhpS2J0ZjJsWmk1djhnTm56VStlZnRjYnJmQnh0UjJ5dzJyVGZuVTlVUGZFbXJ1d1BnQVZoanArMlQrWmtZTHMKMkV3SHlpcVJMUTdnUFVHSHErRnc0Zzhlczk3UUFydFZ2cDB5cEdrRTZPZHQzdnZtYnA0L0libGtRcjdwYlpacwpmRXNPOG5DZW91ejNDbzlKQVI4MHJpQ09UdDk5dXJpNHU5RFowZE5ya0NGeTdsY3E5SUcrak04dW5TWWVpSE1LCjJNcXE4ZEpJTzV0UnVaa2JHcURIZmZETk5ZTXhzK2w2WS96ZEdDZkl1NkhqNitKNlh5dGVMNkdHVVpTRFRJTUkKRmdDaEVLVTVMKzUya0NCejUyK01SWlZuM25MU01sdVN2UUduWDJQdkhPKzJMdnZWckI3endOWitQMjR3U1Z6ZwpNdXl1cmN4YitLdVZTSThaN1pvQWRIUXdOWFVtK1JGd2pQZmJMV3ltbkwwVlhhSnhqT1I1MS9ZWlRrK3hrT25jCk5DMml4b3l5LzRDM2V4dGh4dnJVZ1NnN1IxaVo1VFlOazJHdDViaXFZVm5tYmd3UDd3eVF4ZXd6ekNydFdMM0IKWXRJaVNiTTNwOTI4U3MvM2Q2T04rTTRyS0hQSmZzc2t1NUYvVTljPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
              - host                   = "https://demo-k8s-33c3c578.hcp.southeastasia.azmk8s.io:443"
              - password               = "1f912bbdb7463d656c009271bafb2902ae651c7d74a3439ceab445394e2b3bb185c5412b85fb16e5e91230ef7c84db39efd60f7ff0d15e158be7f2e07326098d"
              - username               = "clusterAdmin_demo-k8s-rg_demo-k8s"
            },
        ] -> (known after apply)
      ~ kube_admin_config_raw           = (sensitive value)
      ~ kube_config                     = [
          - {
              - client_certificate     = ""
              - client_key             = ""
              - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUV5VENDQXJHZ0F3SUJBZ0lRWkVPR2hwQzk1d3hWYVJoQ0pqMmVXVEFOQmdrcWhraUc5dzBCQVFzRkFEQU4KTVFzd0NRWURWUVFERXdKallUQWdGdzB5TURFeE1EZ3hORE0zTWpOYUdBOHlNRFV3TVRFd09ERTBORGN5TTFvdwpEVEVMTUFrR0ExVUVBeE1DWTJFd2dnSWlNQTBHQ1NxR1NJYjNEUUVCQVFVQUE0SUNEd0F3Z2dJS0FvSUNBUURTCjRpbjU3ekJhWFdOZ2xLYnlUTnROdCsyUldleUlxQ1NJRnRvM1VGc1VzR28wQzhMNlpNcnJub0N6ZDRKTy94ekEKbHozdmEwVFY3eExNb0JqY1JUSGJUV2wyQklBUko4a01Qc0c4UUZwekFHbGJ0cmJmUHVBOUd4c3U5eUd6WmpNSwozZUFpNjdoUzZkc1RjNFJ4dHFzQng1Uzdkc0lSOTNVU0cvNWhhRE5wZzlHcm5vWCtyVFpjd0FsL2hqMTZSZlp4Cis4eE95VVJjbzIxTGo1K0FlTzFlN1Y4RHhvT29mZ0RXS2hROGQ0MVp2TkNEdGJVcGZTQlo3N3dHMVBrSG1vdmoKcHlvNEwzQWtBcmxYY1RWZ1ZzOE5NbmZ6emlva0VtTDgvTUxZenVaWlNpZTN2MlhjUElHMDE5YmZoalowRXh3agp4RDBENmMwdXg0VGhRZGg3bHh4cTJ0UlY5MHlPbG5xTk0yY0VSYTQvYnllVVdRSUgra3ExUGFYY1RIZTk5Qit3Cnh6M214Y29RVXBOZ0dLVXByK1lIL0llak9CYUVTaWxmWVBWaVdyNytKQ1lQZlYvUy82QVhJcXlMSTJ4R3V2OTIKRXFGM1lvbUJNaEl6aWdmckZGTFoxRkcvTWt5NVE2MWVGMjlQYm1xdnRSZHJGWHBud2VQNk9lY3dzZkplUnh4WQpVSkxFZTlxYkhhek5LajZxMENVVFFYQWZESkgvaGw3Wi9xQllhSTEyNFl0YW9iRWFoZTkwVWJ3Q3ByR1ZScUFqCmwzSHFvTTVwTlRpeGQvRDdybXR6WWRvenMxOThDcG9KSnFqbnErcVJxMndwN3NCWmVqa1hTSmovVTJuM2hVL1cKcFp1ZW5YVjh5Vm13VTEwN3hMaW1OQjB5R3k2aDBBSHJHeG45eGFnYVl3SURBUUFCb3lNd0lUQU9CZ05WSFE4QgpBZjhFQkFNQ0FxUXdEd1lEVlIwVEFRSC9CQVV3QXdFQi96QU5CZ2txaGtpRzl3MEJBUXNGQUFPQ0FnRUFhaG1YCklhcDFybytwc1RZNXlTSUhrdTlmSU5GNHNHaXVldlRHVnRJWkFFbUZsWUIwU0xnOFdYbnE4SnkvNDBEbzA5NG4KdXdIV1NXYzVGR3R0Y2JrRDRUTzQxUXMwQ01RRnhIQzlNMjlta1FpVjJ1RkRsWHNMOEdRTFNJcGFZTzExRWdWbQptNXhxSG10WStHRFlWTkIyWURLSUZYMHpEb1FDTmNSUjF0NDYydzhlc3ltUWlXaDhpWUgySExiQU9KU2hzYWs2CjhpS2J0ZjJsWmk1djhnTm56VStlZnRjYnJmQnh0UjJ5dzJyVGZuVTlVUGZFbXJ1d1BnQVZoanArMlQrWmtZTHMKMkV3SHlpcVJMUTdnUFVHSHErRnc0Zzhlczk3UUFydFZ2cDB5cEdrRTZPZHQzdnZtYnA0L0libGtRcjdwYlpacwpmRXNPOG5DZW91ejNDbzlKQVI4MHJpQ09UdDk5dXJpNHU5RFowZE5ya0NGeTdsY3E5SUcrak04dW5TWWVpSE1LCjJNcXE4ZEpJTzV0UnVaa2JHcURIZmZETk5ZTXhzK2w2WS96ZEdDZkl1NkhqNitKNlh5dGVMNkdHVVpTRFRJTUkKRmdDaEVLVTVMKzUya0NCejUyK01SWlZuM25MU01sdVN2UUduWDJQdkhPKzJMdnZWckI3endOWitQMjR3U1Z6ZwpNdXl1cmN4YitLdVZTSThaN1pvQWRIUXdOWFVtK1JGd2pQZmJMV3ltbkwwVlhhSnhqT1I1MS9ZWlRrK3hrT25jCk5DMml4b3l5LzRDM2V4dGh4dnJVZ1NnN1IxaVo1VFlOazJHdDViaXFZVm5tYmd3UDd3eVF4ZXd6ekNydFdMM0IKWXRJaVNiTTNwOTI4U3MvM2Q2T04rTTRyS0hQSmZzc2t1NUYvVTljPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
              - host                   = "https://demo-k8s-33c3c578.hcp.southeastasia.azmk8s.io:443"
              - password               = ""
              - username               = "clusterUser_demo-k8s-rg_demo-k8s"
            },
        ] -> (known after apply)
      ~ kube_config_raw                 = (sensitive value)
      ~ kubelet_identity                = [
          - {
              - client_id                 = "830c9662-1dd9-414b-ade9-7236de471da4"
              - object_id                 = "afbbcecf-4b7f-47ff-9f4d-ebe08606f356"
              - user_assigned_identity_id = "/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/MC_demo-k8s-rg_demo-k8s_southeastasia/providers/Microsoft.ManagedIdentity/userAssignedIdentities/demo-k8s-agentpool"
            },
        ] -> (known after apply)
      ~ kubernetes_version              = "1.17.13" -> (known after apply)
        name                            = "demo-k8s"
      ~ node_resource_group             = "MC_demo-k8s-rg_demo-k8s_southeastasia" -> (known after apply)
      ~ private_cluster_enabled         = false -> (known after apply)
      + private_fqdn                    = (known after apply)
      ~ private_link_enabled            = false -> (known after apply)
      - tags                            = {} -> null
        # (4 unchanged attributes hidden)

      ~ addon_profile {
          ~ aci_connector_linux {
                # (1 unchanged attribute hidden)
            }


          ~ http_application_routing {
              ~ enabled                            = false -> true # forces replacement
              + http_application_routing_zone_name = (known after apply)
            }


          ~ oms_agent {
              ~ oms_agent_identity         = [
                  - {
                      - client_id                 = "d411b094-9ef0-4aaf-a1ec-61d05471b543"
                      - object_id                 = "7157193c-2993-49b5-a778-c11cfa382ef1"
                      - user_assigned_identity_id = "/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/MC_demo-k8s-rg_demo-k8s_southeastasia/providers/Microsoft.ManagedIdentity/userAssignedIdentities/omsagent-demo-k8s"
                    },
                ] -> (known after apply)
                # (2 unchanged attributes hidden)
            }
            # (2 unchanged blocks hidden)
        }

      ~ auto_scaler_profile {
          ~ balance_similar_node_groups      = false -> (known after apply)
          ~ max_graceful_termination_sec     = "600" -> (known after apply)
          ~ scale_down_delay_after_add       = "10m" -> (known after apply)
          ~ scale_down_delay_after_delete    = "10s" -> (known after apply)
          ~ scale_down_delay_after_failure   = "3m" -> (known after apply)
          ~ scale_down_unneeded              = "10m" -> (known after apply)
          ~ scale_down_unready               = "20m" -> (known after apply)
          ~ scale_down_utilization_threshold = "0.5" -> (known after apply)
          ~ scan_interval                    = "10s" -> (known after apply)
        }

      ~ default_node_pool {
          - enable_node_public_ip = false -> null
          ~ max_pods              = 110 -> (known after apply)
            name                  = "system"
          ~ node_count            = 1 -> (known after apply)
          - node_labels           = {} -> null
          - node_taints           = [] -> null
          ~ orchestrator_version  = "1.17.13" -> (known after apply)
          ~ os_disk_size_gb       = 128 -> (known after apply)
          - tags                  = {} -> null
            # (6 unchanged attributes hidden)
        }

      ~ identity {
          ~ principal_id = "0ec28a32-58b1-4a89-9be5-e1238b4d359a" -> (known after apply)
          ~ tenant_id    = "14485795-c84c-451a-bb0a-1610c5b5f017" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ network_profile {
          ~ dns_service_ip     = "10.0.0.10" -> (known after apply)
          ~ docker_bridge_cidr = "172.17.0.1/16" -> (known after apply)
          ~ load_balancer_sku  = "Standard" -> "standard"
          + network_policy     = (known after apply)
          ~ pod_cidr           = "10.244.0.0/16" -> (known after apply)
          ~ service_cidr       = "10.0.0.0/16" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ load_balancer_profile {
              ~ effective_outbound_ips    = [
                  - "/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourceGroups/MC_demo-k8s-rg_demo-k8s_southeastasia/providers/Microsoft.Network/publicIPAddresses/47f0139f-46bb-4889-a6d4-59eb5f6dae8c",
                ] -> (known after apply)
              ~ idle_timeout_in_minutes   = 0 -> (known after apply)
              ~ managed_outbound_ip_count = 1 -> (known after apply)
              ~ outbound_ip_address_ids   = [] -> (known after apply)
              ~ outbound_ip_prefix_ids    = [] -> (known after apply)
              ~ outbound_ports_allocated  = 0 -> (known after apply)
            }
        }

      ~ role_based_access_control {
            # (1 unchanged attribute hidden)

          ~ azure_active_directory {
              ~ tenant_id              = "14485795-c84c-451a-bb0a-1610c5b5f017" -> (known after apply)
                # (2 unchanged attributes hidden)
            }
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
        }
    }

  # azurerm_kubernetes_cluster_node_pool.k8s_nodepool_dev must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "k8s_nodepool_dev" {
      - enable_node_public_ip = false -> null
      ~ id                    = "/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/demo-k8s-rg/providers/Microsoft.ContainerService/managedClusters/demo-k8s/agentPools/devtest" -> (known after apply)
      ~ kubernetes_cluster_id = "/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/demo-k8s-rg/providers/Microsoft.ContainerService/managedClusters/demo-k8s" -> (known after apply) # forces replacement
      ~ max_count             = 3 -> 10
      ~ max_pods              = 110 -> (known after apply)
      ~ min_count             = 0 -> 1
        name                  = "devtest"
      ~ node_count            = 0 -> (known after apply)
      - node_labels           = {} -> null
      - node_taints           = [] -> null
      ~ orchestrator_version  = "1.17.13" -> (known after apply)
      ~ os_disk_size_gb       = 128 -> (known after apply)
      - tags                  = {} -> null
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ host        = "https://demo-k8s-33c3c578.hcp.southeastasia.azmk8s.io:443" -> (known after apply)
  ~ id          = "/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/demo-k8s-rg/providers/Microsoft.ContainerService/managedClusters/demo-k8s" -> (known after apply)
  ~ kube_config = <<-EOT
        apiVersion: v1
        clusters:
        - cluster:
            certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUV5VENDQXJHZ0F3SUJBZ0lRWkVPR2hwQzk1d3hWYVJoQ0pqMmVXVEFOQmdrcWhraUc5dzBCQVFzRkFEQU4KTVFzd0NRWURWUVFERXdKallUQWdGdzB5TURFeE1EZ3hORE0zTWpOYUdBOHlNRFV3TVRFd09ERTBORGN5TTFvdwpEVEVMTUFrR0ExVUVBeE1DWTJFd2dnSWlNQTBHQ1NxR1NJYjNEUUVCQVFVQUE0SUNEd0F3Z2dJS0FvSUNBUURTCjRpbjU3ekJhWFdOZ2xLYnlUTnROdCsyUldleUlxQ1NJRnRvM1VGc1VzR28wQzhMNlpNcnJub0N6ZDRKTy94ekEKbHozdmEwVFY3eExNb0JqY1JUSGJUV2wyQklBUko4a01Qc0c4UUZwekFHbGJ0cmJmUHVBOUd4c3U5eUd6WmpNSwozZUFpNjdoUzZkc1RjNFJ4dHFzQng1Uzdkc0lSOTNVU0cvNWhhRE5wZzlHcm5vWCtyVFpjd0FsL2hqMTZSZlp4Cis4eE95VVJjbzIxTGo1K0FlTzFlN1Y4RHhvT29mZ0RXS2hROGQ0MVp2TkNEdGJVcGZTQlo3N3dHMVBrSG1vdmoKcHlvNEwzQWtBcmxYY1RWZ1ZzOE5NbmZ6emlva0VtTDgvTUxZenVaWlNpZTN2MlhjUElHMDE5YmZoalowRXh3agp4RDBENmMwdXg0VGhRZGg3bHh4cTJ0UlY5MHlPbG5xTk0yY0VSYTQvYnllVVdRSUgra3ExUGFYY1RIZTk5Qit3Cnh6M214Y29RVXBOZ0dLVXByK1lIL0llak9CYUVTaWxmWVBWaVdyNytKQ1lQZlYvUy82QVhJcXlMSTJ4R3V2OTIKRXFGM1lvbUJNaEl6aWdmckZGTFoxRkcvTWt5NVE2MWVGMjlQYm1xdnRSZHJGWHBud2VQNk9lY3dzZkplUnh4WQpVSkxFZTlxYkhhek5LajZxMENVVFFYQWZESkgvaGw3Wi9xQllhSTEyNFl0YW9iRWFoZTkwVWJ3Q3ByR1ZScUFqCmwzSHFvTTVwTlRpeGQvRDdybXR6WWRvenMxOThDcG9KSnFqbnErcVJxMndwN3NCWmVqa1hTSmovVTJuM2hVL1cKcFp1ZW5YVjh5Vm13VTEwN3hMaW1OQjB5R3k2aDBBSHJHeG45eGFnYVl3SURBUUFCb3lNd0lUQU9CZ05WSFE4QgpBZjhFQkFNQ0FxUXdEd1lEVlIwVEFRSC9CQVV3QXdFQi96QU5CZ2txaGtpRzl3MEJBUXNGQUFPQ0FnRUFhaG1YCklhcDFybytwc1RZNXlTSUhrdTlmSU5GNHNHaXVldlRHVnRJWkFFbUZsWUIwU0xnOFdYbnE4SnkvNDBEbzA5NG4KdXdIV1NXYzVGR3R0Y2JrRDRUTzQxUXMwQ01RRnhIQzlNMjlta1FpVjJ1RkRsWHNMOEdRTFNJcGFZTzExRWdWbQptNXhxSG10WStHRFlWTkIyWURLSUZYMHpEb1FDTmNSUjF0NDYydzhlc3ltUWlXaDhpWUgySExiQU9KU2hzYWs2CjhpS2J0ZjJsWmk1djhnTm56VStlZnRjYnJmQnh0UjJ5dzJyVGZuVTlVUGZFbXJ1d1BnQVZoanArMlQrWmtZTHMKMkV3SHlpcVJMUTdnUFVHSHErRnc0Zzhlczk3UUFydFZ2cDB5cEdrRTZPZHQzdnZtYnA0L0libGtRcjdwYlpacwpmRXNPOG5DZW91ejNDbzlKQVI4MHJpQ09UdDk5dXJpNHU5RFowZE5ya0NGeTdsY3E5SUcrak04dW5TWWVpSE1LCjJNcXE4ZEpJTzV0UnVaa2JHcURIZmZETk5ZTXhzK2w2WS96ZEdDZkl1NkhqNitKNlh5dGVMNkdHVVpTRFRJTUkKRmdDaEVLVTVMKzUya0NCejUyK01SWlZuM25MU01sdVN2UUduWDJQdkhPKzJMdnZWckI3endOWitQMjR3U1Z6ZwpNdXl1cmN4YitLdVZTSThaN1pvQWRIUXdOWFVtK1JGd2pQZmJMV3ltbkwwVlhhSnhqT1I1MS9ZWlRrK3hrT25jCk5DMml4b3l5LzRDM2V4dGh4dnJVZ1NnN1IxaVo1VFlOazJHdDViaXFZVm5tYmd3UDd3eVF4ZXd6ekNydFdMM0IKWXRJaVNiTTNwOTI4U3MvM2Q2T04rTTRyS0hQSmZzc2t1NUYvVTljPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
            server: https://demo-k8s-33c3c578.hcp.southeastasia.azmk8s.io:443
          name: demo-k8s
        contexts:
        - context:
            cluster: demo-k8s
            user: clusterUser_demo-k8s-rg_demo-k8s
          name: demo-k8s
        current-context: demo-k8s
        kind: Config
        preferences: {}
        users:
        - name: clusterUser_demo-k8s-rg_demo-k8s
          user:
            auth-provider:
              config:
                apiserver-id: 6dae42f8-4368-4678-94ff-3960e28e3630
                client-id: 80faf920-1908-4b52-b5ef-a8e7bedfc67a
                config-mode: "1"
                environment: AzurePublicCloud
                tenant-id: 14485795-c84c-451a-bb0a-1610c5b5f017
              name: azure
    EOT -> (known after apply)

Warning: Version constraints inside provider configuration blocks are deprecated

  on main.tf line 34, in provider "azurerm":
  34:   version = "~> 2.14.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.


------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...
```
</details>s
*Pusher: @SatyKrish, Action: `pull_request`*